# Updating Rows and Columns ==> Modifying Data Within DataFrames

In [2]:
people = {
    "Name" : ["Jafar","Surya","Vikram"],
    "No"   : [10,20,30],
    "Mail" : ["shaikmohammadhussain999@gmail.com","Surya@gmail.com","Vikram@gmail.com"]
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

In [6]:
df.columns

Index(['Name', 'No', 'Mail'], dtype='object')

# To Update the column name

In [7]:
df.columns = ["First Name","Number","Gmail"]

In [8]:
df

  First Name  Number                              Gmail
0      Jafar      10  shaikmohammadhussain999@gmail.com
1      Surya      20                    Surya@gmail.com
2     Vikram      30                   Vikram@gmail.com

In [9]:
df.columns = df.columns.str.replace(' ','_')
df

  First_Name  Number                              Gmail
0      Jafar      10  shaikmohammadhussain999@gmail.com
1      Surya      20                    Surya@gmail.com
2     Vikram      30                   Vikram@gmail.com

In [10]:
df.columns = [x.lower() for x in df.columns]
df

  first_name  number                              gmail
0      Jafar      10  shaikmohammadhussain999@gmail.com
1      Surya      20                    Surya@gmail.com
2     Vikram      30                   Vikram@gmail.com

In [11]:
df.rename(columns={'first_name' : 'first','number' : 'no'},inplace=True)
df

    first  no                              gmail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

# Updating the value

In [12]:
df.loc[2] = ['Hussain',40,'hussain@gmail.com']

In [13]:
df

     first  no                              gmail
0    Jafar  10  shaikmohammadhussain999@gmail.com
1    Surya  20                    Surya@gmail.com
2  Hussain  40                  hussain@gmail.com

In [14]:
df.at[2,'no'] = 30
df

     first  no                              gmail
0    Jafar  10  shaikmohammadhussain999@gmail.com
1    Surya  20                    Surya@gmail.com
2  Hussain  30                  hussain@gmail.com

In [15]:
filt = df['first'] == 'Hussain'
df.loc[filt,'first'] = 'Vikram'
df

    first  no                              gmail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                  hussain@gmail.com

In [16]:
df['gmail'].str.lower()
df

    first  no                              gmail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                  hussain@gmail.com

apply
map
applymap
replace

In [17]:
df['gmail'].apply(len)

0    33
1    15
2    17
Name: gmail, dtype: int64

In [21]:
def update_gmail(email):
    return email.upper()

In [23]:
df['gmail'] = df['gmail'].apply(update_gmail)
df

    first  no                              gmail
0   Jafar  10  SHAIKMOHAMMADHUSSAIN999@GMAIL.COM
1   Surya  20                    SURYA@GMAIL.COM
2  Vikram  30                  HUSSAIN@GMAIL.COM

In [24]:
df['gmail'] = df['gmail'].apply(lambda x:x.lower())
df

    first  no                              gmail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    surya@gmail.com
2  Vikram  30                  hussain@gmail.com

In [25]:
df.apply(len)

first    3
no       3
gmail    3
dtype: int64